kercre123/victor/robot/fixture/cube/sdk_da1458x/5.0.4/sdk/platform/include/reg_modem.h
#ifndef _REG_MODEM_H_
#define _REG_MODEM_H_

#include <stdint.h>

#include "_reg_modem.h"
#include "arch.h"
#include "compiler.h"
#include "reg_access.h"

#define REG_MODEM_COUNT 53

#define REG_MODEM_DECODING_MASK 0x000000FF

/**
 * @brief VERSION register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:24                  TYP   0x1
 *  23:16                  REL   0x1
 *  15:08                  UPG   0x1
 *  07:00                BUILD   0x0
 * </pre>
 */
#define MDM_VERSION_ADDR 0x00000080
#define MDM_VERSION_OFFSET 0x00000080
#define MDM_VERSION_INDEX 0x00000020
#define MDM_VERSION_RESET 0x01010100

__INLINE uint32_t mdm_version_get(void) { return REG_RPL_RD(MDM_VERSION_ADDR); }

// field definitions
#define MDM_TYP_MASK ((uint32_t)0xFF000000)
#define MDM_TYP_LSB 24
#define MDM_TYP_WIDTH ((uint32_t)0x00000008)
#define MDM_REL_MASK ((uint32_t)0x00FF0000)
#define MDM_REL_LSB 16
#define MDM_REL_WIDTH ((uint32_t)0x00000008)
#define MDM_UPG_MASK ((uint32_t)0x0000FF00)
#define MDM_UPG_LSB 8
#define MDM_UPG_WIDTH ((uint32_t)0x00000008)
#define MDM_BUILD_MASK ((uint32_t)0x000000FF)
#define MDM_BUILD_LSB 0
#define MDM_BUILD_WIDTH ((uint32_t)0x00000008)

#define MDM_TYP_RST 0x1
#define MDM_REL_RST 0x1
#define MDM_UPG_RST 0x1
#define MDM_BUILD_RST 0x0

__INLINE void mdm_version_unpack(uint8_t* typ, uint8_t* rel, uint8_t* upg,
                                 uint8_t* build) {
  uint32_t localVal = REG_RPL_RD(MDM_VERSION_ADDR);

  *typ = (localVal & ((uint32_t)0xFF000000)) >> 24;
  *rel = (localVal & ((uint32_t)0x00FF0000)) >> 16;
  *upg = (localVal & ((uint32_t)0x0000FF00)) >> 8;
  *build = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

__INLINE uint8_t mdm_typ_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_VERSION_ADDR);
  return ((localVal & ((uint32_t)0xFF000000)) >> 24);
}

__INLINE uint8_t mdm_rel_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_VERSION_ADDR);
  return ((localVal & ((uint32_t)0x00FF0000)) >> 16);
}

__INLINE uint8_t mdm_upg_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_VERSION_ADDR);
  return ((localVal & ((uint32_t)0x0000FF00)) >> 8);
}

__INLINE uint8_t mdm_build_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_VERSION_ADDR);
  return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

/**
 * @brief MDM_CNTL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     01         DUAL_MODE_EN   0
 *     00          RXFE_BYPASS   0
 * </pre>
 */
#define MDM_MDM_CNTL_ADDR 0x00000081
#define MDM_MDM_CNTL_OFFSET 0x00000081
#define MDM_MDM_CNTL_INDEX 0x00000020
#define MDM_MDM_CNTL_RESET 0x00000000

__INLINE uint32_t mdm_mdm_cntl_get(void) {
  return REG_RPL_RD(MDM_MDM_CNTL_ADDR);
}

__INLINE void mdm_mdm_cntl_set(uint32_t value) {
  REG_RPL_WR(MDM_MDM_CNTL_ADDR, value);
}

// field definitions
#define MDM_DUAL_MODE_EN_BIT ((uint32_t)0x00000002)
#define MDM_DUAL_MODE_EN_POS 1
#define MDM_RXFE_BYPASS_BIT ((uint32_t)0x00000001)
#define MDM_RXFE_BYPASS_POS 0

#define MDM_DUAL_MODE_EN_RST 0x0
#define MDM_RXFE_BYPASS_RST 0x0

__INLINE void mdm_mdm_cntl_pack(uint8_t dualmodeen, uint8_t rxfebypass) {
  ASSERT_ERR((((uint32_t)dualmodeen << 1) & ~((uint32_t)0x00000002)) == 0);
  ASSERT_ERR((((uint32_t)rxfebypass << 0) & ~((uint32_t)0x00000001)) == 0);
  REG_RPL_WR(MDM_MDM_CNTL_ADDR,
             ((uint32_t)dualmodeen << 1) | ((uint32_t)rxfebypass << 0));
}

__INLINE void mdm_mdm_cntl_unpack(uint8_t* dualmodeen, uint8_t* rxfebypass) {
  uint32_t localVal = REG_RPL_RD(MDM_MDM_CNTL_ADDR);

  *dualmodeen = (localVal & ((uint32_t)0x00000002)) >> 1;
  *rxfebypass = (localVal & ((uint32_t)0x00000001)) >> 0;
}

__INLINE uint8_t mdm_dual_mode_en_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_MDM_CNTL_ADDR);
  return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

__INLINE void mdm_dual_mode_en_setf(uint8_t dualmodeen) {
  ASSERT_ERR((((uint32_t)dualmodeen << 1) & ~((uint32_t)0x00000002)) == 0);
  REG_RPL_WR(MDM_MDM_CNTL_ADDR,
             (REG_RPL_RD(MDM_MDM_CNTL_ADDR) & ~((uint32_t)0x00000002)) |
                 ((uint32_t)dualmodeen << 1));
}

__INLINE uint8_t mdm_rxfe_bypass_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_MDM_CNTL_ADDR);
  return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

__INLINE void mdm_rxfe_bypass_setf(uint8_t rxfebypass) {
  ASSERT_ERR((((uint32_t)rxfebypass << 0) & ~((uint32_t)0x00000001)) == 0);
  REG_RPL_WR(MDM_MDM_CNTL_ADDR,
             (REG_RPL_RD(MDM_MDM_CNTL_ADDR) & ~((uint32_t)0x00000001)) |
                 ((uint32_t)rxfebypass << 0));
}

/**
 * @brief CLKCNTL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     08           FORCE_GCLK   0
 *     07           RX_GCLK_EN   0
 *     06       RXDPSK_GCLK_EN   0
 *     05       RXACDL_GCLK_EN   0
 *     04       RXGFSK_GCLK_EN   0
 *     02           TX_GCLK_EN   0
 *     01       TXDPSK_GCLK_EN   0
 *     00       TXGFSK_GCLK_EN   0
 * </pre>
 */
#define MDM_CLKCNTL_ADDR 0x00000082
#define MDM_CLKCNTL_OFFSET 0x00000082
#define MDM_CLKCNTL_INDEX 0x00000020
#define MDM_CLKCNTL_RESET 0x00000000

__INLINE uint32_t mdm_clkcntl_get(void) { return REG_RPL_RD(MDM_CLKCNTL_ADDR); }

__INLINE void mdm_clkcntl_set(uint32_t value) {
  REG_RPL_WR(MDM_CLKCNTL_ADDR, value);
}

// field definitions
#define MDM_FORCE_GCLK_BIT ((uint32_t)0x00000100)
#define MDM_FORCE_GCLK_POS 8
#define MDM_RX_GCLK_EN_BIT ((uint32_t)0x00000080)
#define MDM_RX_GCLK_EN_POS 7
#define MDM_RXDPSK_GCLK_EN_BIT ((uint32_t)0x00000040)
#define MDM_RXDPSK_GCLK_EN_POS 6
#define MDM_RXACDL_GCLK_EN_BIT ((uint32_t)0x00000020)
#define MDM_RXACDL_GCLK_EN_POS 5
#define MDM_RXGFSK_GCLK_EN_BIT ((uint32_t)0x00000010)
#define MDM_RXGFSK_GCLK_EN_POS 4
#define MDM_TX_GCLK_EN_BIT ((uint32_t)0x00000004)
#define MDM_TX_GCLK_EN_POS 2
#define MDM_TXDPSK_GCLK_EN_BIT ((uint32_t)0x00000002)
#define MDM_TXDPSK_GCLK_EN_POS 1
#define MDM_TXGFSK_GCLK_EN_BIT ((uint32_t)0x00000001)
#define MDM_TXGFSK_GCLK_EN_POS 0

#define MDM_FORCE_GCLK_RST 0x0
#define MDM_RX_GCLK_EN_RST 0x0
#define MDM_RXDPSK_GCLK_EN_RST 0x0
#define MDM_RXACDL_GCLK_EN_RST 0x0
#define MDM_RXGFSK_GCLK_EN_RST 0x0
#define MDM_TX_GCLK_EN_RST 0x0
#define MDM_TXDPSK_GCLK_EN_RST 0x0
#define MDM_TXGFSK_GCLK_EN_RST 0x0

__INLINE void mdm_clkcntl_pack(uint8_t forcegclk, uint8_t rxgclken,
                               uint8_t rxdpskgclken, uint8_t rxacdlgclken,
                               uint8_t rxgfskgclken, uint8_t txgclken,
                               uint8_t txdpskgclken, uint8_t txgfskgclken) {
  ASSERT_ERR((((uint32_t)forcegclk << 8) & ~((uint32_t)0x00000100)) == 0);
  ASSERT_ERR((((uint32_t)rxgclken << 7) & ~((uint32_t)0x00000080)) == 0);
  ASSERT_ERR((((uint32_t)rxdpskgclken << 6) & ~((uint32_t)0x00000040)) == 0);
  ASSERT_ERR((((uint32_t)rxacdlgclken << 5) & ~((uint32_t)0x00000020)) == 0);
  ASSERT_ERR((((uint32_t)rxgfskgclken << 4) & ~((uint32_t)0x00000010)) == 0);
  ASSERT_ERR((((uint32_t)txgclken << 2) & ~((uint32_t)0x00000004)) == 0);
  ASSERT_ERR((((uint32_t)txdpskgclken << 1) & ~((uint32_t)0x00000002)) == 0);
  ASSERT_ERR((((uint32_t)txgfskgclken << 0) & ~((uint32_t)0x00000001)) == 0);
  REG_RPL_WR(MDM_CLKCNTL_ADDR,
             ((uint32_t)forcegclk << 8) | ((uint32_t)rxgclken << 7) |
                 ((uint32_t)rxdpskgclken << 6) | ((uint32_t)rxacdlgclken << 5) |
                 ((uint32_t)rxgfskgclken << 4) | ((uint32_t)txgclken << 2) |
                 ((uint32_t)txdpskgclken << 1) | ((uint32_t)txgfskgclken << 0));
}

