kercre123/victor/robot/fixture/cube/sdk_da1458x/5.0.4/sdk/platform/include/reg_modem.h
__INLINE void mdm_clkcntl_unpack(uint8_t* forcegclk, uint8_t* rxgclken,
                                 uint8_t* rxdpskgclken, uint8_t* rxacdlgclken,
                                 uint8_t* rxgfskgclken, uint8_t* txgclken,
                                 uint8_t* txdpskgclken, uint8_t* txgfskgclken) {
  uint32_t localVal = REG_RPL_RD(MDM_CLKCNTL_ADDR);

  *forcegclk = (localVal & ((uint32_t)0x00000100)) >> 8;
  *rxgclken = (localVal & ((uint32_t)0x00000080)) >> 7;
  *rxdpskgclken = (localVal & ((uint32_t)0x00000040)) >> 6;
  *rxacdlgclken = (localVal & ((uint32_t)0x00000020)) >> 5;
  *rxgfskgclken = (localVal & ((uint32_t)0x00000010)) >> 4;
  *txgclken = (localVal & ((uint32_t)0x00000004)) >> 2;
  *txdpskgclken = (localVal & ((uint32_t)0x00000002)) >> 1;
  *txgfskgclken = (localVal & ((uint32_t)0x00000001)) >> 0;
}

__INLINE uint8_t mdm_force_gclk_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_CLKCNTL_ADDR);
  return ((localVal & ((uint32_t)0x00000100)) >> 8);
}

__INLINE void mdm_force_gclk_setf(uint8_t forcegclk) {
  ASSERT_ERR((((uint32_t)forcegclk << 8) & ~((uint32_t)0x00000100)) == 0);
  REG_RPL_WR(MDM_CLKCNTL_ADDR,
             (REG_RPL_RD(MDM_CLKCNTL_ADDR) & ~((uint32_t)0x00000100)) |
                 ((uint32_t)forcegclk << 8));
}

__INLINE uint8_t mdm_rx_gclk_en_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_CLKCNTL_ADDR);
  return ((localVal & ((uint32_t)0x00000080)) >> 7);
}

__INLINE void mdm_rx_gclk_en_setf(uint8_t rxgclken) {
  ASSERT_ERR((((uint32_t)rxgclken << 7) & ~((uint32_t)0x00000080)) == 0);
  REG_RPL_WR(MDM_CLKCNTL_ADDR,
             (REG_RPL_RD(MDM_CLKCNTL_ADDR) & ~((uint32_t)0x00000080)) |
                 ((uint32_t)rxgclken << 7));
}

__INLINE uint8_t mdm_rxdpsk_gclk_en_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_CLKCNTL_ADDR);
  return ((localVal & ((uint32_t)0x00000040)) >> 6);
}

__INLINE void mdm_rxdpsk_gclk_en_setf(uint8_t rxdpskgclken) {
  ASSERT_ERR((((uint32_t)rxdpskgclken << 6) & ~((uint32_t)0x00000040)) == 0);
  REG_RPL_WR(MDM_CLKCNTL_ADDR,
             (REG_RPL_RD(MDM_CLKCNTL_ADDR) & ~((uint32_t)0x00000040)) |
                 ((uint32_t)rxdpskgclken << 6));
}

__INLINE uint8_t mdm_rxacdl_gclk_en_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_CLKCNTL_ADDR);
  return ((localVal & ((uint32_t)0x00000020)) >> 5);
}

__INLINE void mdm_rxacdl_gclk_en_setf(uint8_t rxacdlgclken) {
  ASSERT_ERR((((uint32_t)rxacdlgclken << 5) & ~((uint32_t)0x00000020)) == 0);
  REG_RPL_WR(MDM_CLKCNTL_ADDR,
             (REG_RPL_RD(MDM_CLKCNTL_ADDR) & ~((uint32_t)0x00000020)) |
                 ((uint32_t)rxacdlgclken << 5));
}

__INLINE uint8_t mdm_rxgfsk_gclk_en_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_CLKCNTL_ADDR);
  return ((localVal & ((uint32_t)0x00000010)) >> 4);
}

__INLINE void mdm_rxgfsk_gclk_en_setf(uint8_t rxgfskgclken) {
  ASSERT_ERR((((uint32_t)rxgfskgclken << 4) & ~((uint32_t)0x00000010)) == 0);
  REG_RPL_WR(MDM_CLKCNTL_ADDR,
             (REG_RPL_RD(MDM_CLKCNTL_ADDR) & ~((uint32_t)0x00000010)) |
                 ((uint32_t)rxgfskgclken << 4));
}

__INLINE uint8_t mdm_tx_gclk_en_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_CLKCNTL_ADDR);
  return ((localVal & ((uint32_t)0x00000004)) >> 2);
}

__INLINE void mdm_tx_gclk_en_setf(uint8_t txgclken) {
  ASSERT_ERR((((uint32_t)txgclken << 2) & ~((uint32_t)0x00000004)) == 0);
  REG_RPL_WR(MDM_CLKCNTL_ADDR,
             (REG_RPL_RD(MDM_CLKCNTL_ADDR) & ~((uint32_t)0x00000004)) |
                 ((uint32_t)txgclken << 2));
}

__INLINE uint8_t mdm_txdpsk_gclk_en_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_CLKCNTL_ADDR);
  return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

__INLINE void mdm_txdpsk_gclk_en_setf(uint8_t txdpskgclken) {
  ASSERT_ERR((((uint32_t)txdpskgclken << 1) & ~((uint32_t)0x00000002)) == 0);
  REG_RPL_WR(MDM_CLKCNTL_ADDR,
             (REG_RPL_RD(MDM_CLKCNTL_ADDR) & ~((uint32_t)0x00000002)) |
                 ((uint32_t)txdpskgclken << 1));
}

__INLINE uint8_t mdm_txgfsk_gclk_en_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_CLKCNTL_ADDR);
  return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

__INLINE void mdm_txgfsk_gclk_en_setf(uint8_t txgfskgclken) {
  ASSERT_ERR((((uint32_t)txgfskgclken << 0) & ~((uint32_t)0x00000001)) == 0);
  REG_RPL_WR(MDM_CLKCNTL_ADDR,
             (REG_RPL_RD(MDM_CLKCNTL_ADDR) & ~((uint32_t)0x00000001)) |
                 ((uint32_t)txgfskgclken << 0));
}

/**
 * @brief RX_STARTUPDEL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  19:16       BEFORE_RXSTART   0x1
 *  07:00        RX_STARTUPDEL   0xB4
 * </pre>
 */
#define MDM_RX_STARTUPDEL_ADDR 0x00000083
#define MDM_RX_STARTUPDEL_OFFSET 0x00000083
#define MDM_RX_STARTUPDEL_INDEX 0x00000020
#define MDM_RX_STARTUPDEL_RESET 0x000100B4

__INLINE uint32_t mdm_rx_startupdel_get(void) {
  return REG_RPL_RD(MDM_RX_STARTUPDEL_ADDR);
}

__INLINE void mdm_rx_startupdel_set(uint32_t value) {
  REG_RPL_WR(MDM_RX_STARTUPDEL_ADDR, value);
}

// field definitions
#define MDM_BEFORE_RXSTART_MASK ((uint32_t)0x000F0000)
#define MDM_BEFORE_RXSTART_LSB 16
#define MDM_BEFORE_RXSTART_WIDTH ((uint32_t)0x00000004)
#define MDM_RX_STARTUPDEL_MASK ((uint32_t)0x000000FF)
#define MDM_RX_STARTUPDEL_LSB 0
#define MDM_RX_STARTUPDEL_WIDTH ((uint32_t)0x00000008)

#define MDM_BEFORE_RXSTART_RST 0x1
#define MDM_RX_STARTUPDEL_RST 0xB4

__INLINE void mdm_rx_startupdel_pack(uint8_t beforerxstart,
                                     uint8_t rxstartupdel) {
  ASSERT_ERR((((uint32_t)beforerxstart << 16) & ~((uint32_t)0x000F0000)) == 0);
  ASSERT_ERR((((uint32_t)rxstartupdel << 0) & ~((uint32_t)0x000000FF)) == 0);
  REG_RPL_WR(MDM_RX_STARTUPDEL_ADDR,
             ((uint32_t)beforerxstart << 16) | ((uint32_t)rxstartupdel << 0));
}

__INLINE void mdm_rx_startupdel_unpack(uint8_t* beforerxstart,
                                       uint8_t* rxstartupdel) {
  uint32_t localVal = REG_RPL_RD(MDM_RX_STARTUPDEL_ADDR);

  *beforerxstart = (localVal & ((uint32_t)0x000F0000)) >> 16;
  *rxstartupdel = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

