kercre123/victor/robot/fixture/cube/sdk_da1458x/5.0.4/sdk/platform/include/reg_modem.h
__INLINE uint8_t mdm_before_rxstart_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_RX_STARTUPDEL_ADDR);
  return ((localVal & ((uint32_t)0x000F0000)) >> 16);
}

__INLINE void mdm_before_rxstart_setf(uint8_t beforerxstart) {
  ASSERT_ERR((((uint32_t)beforerxstart << 16) & ~((uint32_t)0x000F0000)) == 0);
  REG_RPL_WR(MDM_RX_STARTUPDEL_ADDR,
             (REG_RPL_RD(MDM_RX_STARTUPDEL_ADDR) & ~((uint32_t)0x000F0000)) |
                 ((uint32_t)beforerxstart << 16));
}

__INLINE uint8_t mdm_rx_startupdel_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_RX_STARTUPDEL_ADDR);
  return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

__INLINE void mdm_rx_startupdel_setf(uint8_t rxstartupdel) {
  ASSERT_ERR((((uint32_t)rxstartupdel << 0) & ~((uint32_t)0x000000FF)) == 0);
  REG_RPL_WR(MDM_RX_STARTUPDEL_ADDR,
             (REG_RPL_RD(MDM_RX_STARTUPDEL_ADDR) & ~((uint32_t)0x000000FF)) |
                 ((uint32_t)rxstartupdel << 0));
}

/**
 * @brief TX_STARTUPDEL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  19:16       BEFORE_TXSTART   0x1
 *  07:00        TX_STARTUPDEL   0xB4
 * </pre>
 */
#define MDM_TX_STARTUPDEL_ADDR 0x00000084
#define MDM_TX_STARTUPDEL_OFFSET 0x00000084
#define MDM_TX_STARTUPDEL_INDEX 0x00000021
#define MDM_TX_STARTUPDEL_RESET 0x000100B4

__INLINE uint32_t mdm_tx_startupdel_get(void) {
  return REG_RPL_RD(MDM_TX_STARTUPDEL_ADDR);
}

__INLINE void mdm_tx_startupdel_set(uint32_t value) {
  REG_RPL_WR(MDM_TX_STARTUPDEL_ADDR, value);
}

// field definitions
#define MDM_BEFORE_TXSTART_MASK ((uint32_t)0x000F0000)
#define MDM_BEFORE_TXSTART_LSB 16
#define MDM_BEFORE_TXSTART_WIDTH ((uint32_t)0x00000004)
#define MDM_TX_STARTUPDEL_MASK ((uint32_t)0x000000FF)
#define MDM_TX_STARTUPDEL_LSB 0
#define MDM_TX_STARTUPDEL_WIDTH ((uint32_t)0x00000008)

#define MDM_BEFORE_TXSTART_RST 0x1
#define MDM_TX_STARTUPDEL_RST 0xB4

__INLINE void mdm_tx_startupdel_pack(uint8_t beforetxstart,
                                     uint8_t txstartupdel) {
  ASSERT_ERR((((uint32_t)beforetxstart << 16) & ~((uint32_t)0x000F0000)) == 0);
  ASSERT_ERR((((uint32_t)txstartupdel << 0) & ~((uint32_t)0x000000FF)) == 0);
  REG_RPL_WR(MDM_TX_STARTUPDEL_ADDR,
             ((uint32_t)beforetxstart << 16) | ((uint32_t)txstartupdel << 0));
}

__INLINE void mdm_tx_startupdel_unpack(uint8_t* beforetxstart,
                                       uint8_t* txstartupdel) {
  uint32_t localVal = REG_RPL_RD(MDM_TX_STARTUPDEL_ADDR);

  *beforetxstart = (localVal & ((uint32_t)0x000F0000)) >> 16;
  *txstartupdel = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

__INLINE uint8_t mdm_before_txstart_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_TX_STARTUPDEL_ADDR);
  return ((localVal & ((uint32_t)0x000F0000)) >> 16);
}

__INLINE void mdm_before_txstart_setf(uint8_t beforetxstart) {
  ASSERT_ERR((((uint32_t)beforetxstart << 16) & ~((uint32_t)0x000F0000)) == 0);
  REG_RPL_WR(MDM_TX_STARTUPDEL_ADDR,
             (REG_RPL_RD(MDM_TX_STARTUPDEL_ADDR) & ~((uint32_t)0x000F0000)) |
                 ((uint32_t)beforetxstart << 16));
}

__INLINE uint8_t mdm_tx_startupdel_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_TX_STARTUPDEL_ADDR);
  return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

__INLINE void mdm_tx_startupdel_setf(uint8_t txstartupdel) {
  ASSERT_ERR((((uint32_t)txstartupdel << 0) & ~((uint32_t)0x000000FF)) == 0);
  REG_RPL_WR(MDM_TX_STARTUPDEL_ADDR,
             (REG_RPL_RD(MDM_TX_STARTUPDEL_ADDR) & ~((uint32_t)0x000000FF)) |
                 ((uint32_t)txstartupdel << 0));
}

/**
 * @brief TX_GFSKMODE register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     01             FMTX2PEN   0
 *     00               FMTXEN   0
 * </pre>
 */
#define MDM_TX_GFSKMODE_ADDR 0x00000085
#define MDM_TX_GFSKMODE_OFFSET 0x00000085
#define MDM_TX_GFSKMODE_INDEX 0x00000021
#define MDM_TX_GFSKMODE_RESET 0x00000000

__INLINE uint32_t mdm_tx_gfskmode_get(void) {
  return REG_RPL_RD(MDM_TX_GFSKMODE_ADDR);
}

__INLINE void mdm_tx_gfskmode_set(uint32_t value) {
  REG_RPL_WR(MDM_TX_GFSKMODE_ADDR, value);
}

// field definitions
#define MDM_FMTX2PEN_BIT ((uint32_t)0x00000002)
#define MDM_FMTX2PEN_POS 1
#define MDM_FMTXEN_BIT ((uint32_t)0x00000001)
#define MDM_FMTXEN_POS 0

#define MDM_FMTX2PEN_RST 0x0
#define MDM_FMTXEN_RST 0x0

__INLINE void mdm_tx_gfskmode_pack(uint8_t fmtx2pen, uint8_t fmtxen) {
  ASSERT_ERR((((uint32_t)fmtx2pen << 1) & ~((uint32_t)0x00000002)) == 0);
  ASSERT_ERR((((uint32_t)fmtxen << 0) & ~((uint32_t)0x00000001)) == 0);
  REG_RPL_WR(MDM_TX_GFSKMODE_ADDR,
             ((uint32_t)fmtx2pen << 1) | ((uint32_t)fmtxen << 0));
}

__INLINE void mdm_tx_gfskmode_unpack(uint8_t* fmtx2pen, uint8_t* fmtxen) {
  uint32_t localVal = REG_RPL_RD(MDM_TX_GFSKMODE_ADDR);

  *fmtx2pen = (localVal & ((uint32_t)0x00000002)) >> 1;
  *fmtxen = (localVal & ((uint32_t)0x00000001)) >> 0;
}

__INLINE uint8_t mdm_fmtx2pen_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_TX_GFSKMODE_ADDR);
  return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

__INLINE void mdm_fmtx2pen_setf(uint8_t fmtx2pen) {
  ASSERT_ERR((((uint32_t)fmtx2pen << 1) & ~((uint32_t)0x00000002)) == 0);
  REG_RPL_WR(MDM_TX_GFSKMODE_ADDR,
             (REG_RPL_RD(MDM_TX_GFSKMODE_ADDR) & ~((uint32_t)0x00000002)) |
                 ((uint32_t)fmtx2pen << 1));
}

__INLINE uint8_t mdm_fmtxen_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_TX_GFSKMODE_ADDR);
  return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

__INLINE void mdm_fmtxen_setf(uint8_t fmtxen) {
  ASSERT_ERR((((uint32_t)fmtxen << 0) & ~((uint32_t)0x00000001)) == 0);
  REG_RPL_WR(MDM_TX_GFSKMODE_ADDR,
             (REG_RPL_RD(MDM_TX_GFSKMODE_ADDR) & ~((uint32_t)0x00000001)) |
                 ((uint32_t)fmtxen << 0));
}

/**
 * @brief DIAGCNTL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  07:00             DIAGCNTL   0x0
 * </pre>
 */
#define MDM_DIAGCNTL_ADDR 0x00000086
#define MDM_DIAGCNTL_OFFSET 0x00000086
#define MDM_DIAGCNTL_INDEX 0x00000021
#define MDM_DIAGCNTL_RESET 0x00000000

__INLINE uint32_t mdm_diagcntl_get(void) {
  return REG_RPL_RD(MDM_DIAGCNTL_ADDR);
}

__INLINE void mdm_diagcntl_set(uint32_t value) {
  REG_RPL_WR(MDM_DIAGCNTL_ADDR, value);
}

