kercre123/victor/robot/fixture/cube/sdk_da1458x/5.0.4/sdk/platform/include/reg_modem.h
__INLINE uint8_t mdm_le_dfe_forceraw_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_RXGFSK_CNTL_ADDR);
  return ((localVal & ((uint32_t)0x00000080)) >> 7);
}

__INLINE void mdm_le_dfe_forceraw_setf(uint8_t ledfeforceraw) {
  ASSERT_ERR((((uint32_t)ledfeforceraw << 7) & ~((uint32_t)0x00000080)) == 0);
  REG_RPL_WR(MDM_RXGFSK_CNTL_ADDR,
             (REG_RPL_RD(MDM_RXGFSK_CNTL_ADDR) & ~((uint32_t)0x00000080)) |
                 ((uint32_t)ledfeforceraw << 7));
}

__INLINE uint8_t mdm_bt_dfe_forceraw_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_RXGFSK_CNTL_ADDR);
  return ((localVal & ((uint32_t)0x00000008)) >> 3);
}

__INLINE void mdm_bt_dfe_forceraw_setf(uint8_t btdfeforceraw) {
  ASSERT_ERR((((uint32_t)btdfeforceraw << 3) & ~((uint32_t)0x00000008)) == 0);
  REG_RPL_WR(MDM_RXGFSK_CNTL_ADDR,
             (REG_RPL_RD(MDM_RXGFSK_CNTL_ADDR) & ~((uint32_t)0x00000008)) |
                 ((uint32_t)btdfeforceraw << 3));
}

__INLINE uint8_t mdm_gfo_enpl_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_RXGFSK_CNTL_ADDR);
  return ((localVal & ((uint32_t)0x00000004)) >> 2);
}

__INLINE void mdm_gfo_enpl_setf(uint8_t gfoenpl) {
  ASSERT_ERR((((uint32_t)gfoenpl << 2) & ~((uint32_t)0x00000004)) == 0);
  REG_RPL_WR(MDM_RXGFSK_CNTL_ADDR,
             (REG_RPL_RD(MDM_RXGFSK_CNTL_ADDR) & ~((uint32_t)0x00000004)) |
                 ((uint32_t)gfoenpl << 2));
}

__INLINE uint8_t mdm_gfo_ensw_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_RXGFSK_CNTL_ADDR);
  return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

__INLINE void mdm_gfo_ensw_setf(uint8_t gfoensw) {
  ASSERT_ERR((((uint32_t)gfoensw << 1) & ~((uint32_t)0x00000002)) == 0);
  REG_RPL_WR(MDM_RXGFSK_CNTL_ADDR,
             (REG_RPL_RD(MDM_RXGFSK_CNTL_ADDR) & ~((uint32_t)0x00000002)) |
                 ((uint32_t)gfoensw << 1));
}

__INLINE uint8_t mdm_psd_avgen_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_RXGFSK_CNTL_ADDR);
  return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

__INLINE void mdm_psd_avgen_setf(uint8_t psdavgen) {
  ASSERT_ERR((((uint32_t)psdavgen << 0) & ~((uint32_t)0x00000001)) == 0);
  REG_RPL_WR(MDM_RXGFSK_CNTL_ADDR,
             (REG_RPL_RD(MDM_RXGFSK_CNTL_ADDR) & ~((uint32_t)0x00000001)) |
                 ((uint32_t)psdavgen << 0));
}

/**
 * @brief GFO_P2PTHR register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  09:00           GFO_P2PTHR   0x100
 * </pre>
 */
#define MDM_GFO_P2PTHR_ADDR 0x000000A1
#define MDM_GFO_P2PTHR_OFFSET 0x000000A1
#define MDM_GFO_P2PTHR_INDEX 0x00000028
#define MDM_GFO_P2PTHR_RESET 0x00000100

__INLINE uint32_t mdm_gfo_p2pthr_get(void) {
  return REG_RPL_RD(MDM_GFO_P2PTHR_ADDR);
}

__INLINE void mdm_gfo_p2pthr_set(uint32_t value) {
  REG_RPL_WR(MDM_GFO_P2PTHR_ADDR, value);
}

// field definitions
#define MDM_GFO_P2PTHR_MASK ((uint32_t)0x000003FF)
#define MDM_GFO_P2PTHR_LSB 0
#define MDM_GFO_P2PTHR_WIDTH ((uint32_t)0x0000000A)

#define MDM_GFO_P2PTHR_RST 0x100

__INLINE uint16_t mdm_gfo_p2pthr_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_GFO_P2PTHR_ADDR);
  ASSERT_ERR((localVal & ~((uint32_t)0x000003FF)) == 0);
  return (localVal >> 0);
}

__INLINE void mdm_gfo_p2pthr_setf(uint16_t gfop2pthr) {
  ASSERT_ERR((((uint32_t)gfop2pthr << 0) & ~((uint32_t)0x000003FF)) == 0);
  REG_RPL_WR(MDM_GFO_P2PTHR_ADDR, (uint32_t)gfop2pthr << 0);
}

/**
 * @brief GFO_REFINIT register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  10:00          GFO_REFINIT   0x6CD
 * </pre>
 */
#define MDM_GFO_REFINIT_ADDR 0x000000A2
#define MDM_GFO_REFINIT_OFFSET 0x000000A2
#define MDM_GFO_REFINIT_INDEX 0x00000028
#define MDM_GFO_REFINIT_RESET 0x000006CD

__INLINE uint32_t mdm_gfo_refinit_get(void) {
  return REG_RPL_RD(MDM_GFO_REFINIT_ADDR);
}

__INLINE void mdm_gfo_refinit_set(uint32_t value) {
  REG_RPL_WR(MDM_GFO_REFINIT_ADDR, value);
}

// field definitions
#define MDM_GFO_REFINIT_MASK ((uint32_t)0x000007FF)
#define MDM_GFO_REFINIT_LSB 0
#define MDM_GFO_REFINIT_WIDTH ((uint32_t)0x0000000B)

#define MDM_GFO_REFINIT_RST 0x6CD

__INLINE uint16_t mdm_gfo_refinit_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_GFO_REFINIT_ADDR);
  ASSERT_ERR((localVal & ~((uint32_t)0x000007FF)) == 0);
  return (localVal >> 0);
}

__INLINE void mdm_gfo_refinit_setf(uint16_t gforefinit) {
  ASSERT_ERR((((uint32_t)gforefinit << 0) & ~((uint32_t)0x000007FF)) == 0);
  REG_RPL_WR(MDM_GFO_REFINIT_ADDR, (uint32_t)gforefinit << 0);
}

/**
 * @brief GFO_GFSKDETECT register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  10:00       GFO_GFSKDETECT   0x12C
 * </pre>
 */
#define MDM_GFO_GFSKDETECT_ADDR 0x000000A3
#define MDM_GFO_GFSKDETECT_OFFSET 0x000000A3
#define MDM_GFO_GFSKDETECT_INDEX 0x00000028
#define MDM_GFO_GFSKDETECT_RESET 0x0000012C

__INLINE uint32_t mdm_gfo_gfskdetect_get(void) {
  return REG_RPL_RD(MDM_GFO_GFSKDETECT_ADDR);
}

__INLINE void mdm_gfo_gfskdetect_set(uint32_t value) {
  REG_RPL_WR(MDM_GFO_GFSKDETECT_ADDR, value);
}

// field definitions
#define MDM_GFO_GFSKDETECT_MASK ((uint32_t)0x000007FF)
#define MDM_GFO_GFSKDETECT_LSB 0
#define MDM_GFO_GFSKDETECT_WIDTH ((uint32_t)0x0000000B)

#define MDM_GFO_GFSKDETECT_RST 0x12C

__INLINE uint16_t mdm_gfo_gfskdetect_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_GFO_GFSKDETECT_ADDR);
  ASSERT_ERR((localVal & ~((uint32_t)0x000007FF)) == 0);
  return (localVal >> 0);
}

__INLINE void mdm_gfo_gfskdetect_setf(uint16_t gfogfskdetect) {
  ASSERT_ERR((((uint32_t)gfogfskdetect << 0) & ~((uint32_t)0x000007FF)) == 0);
  REG_RPL_WR(MDM_GFO_GFSKDETECT_ADDR, (uint32_t)gfogfskdetect << 0);
}

/**
 * @brief GFO_SETKDELSW register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  06:00        GFO_SETKDELSW   0x14
 * </pre>
 */
#define MDM_GFO_SETKDELSW_ADDR 0x000000A4
#define MDM_GFO_SETKDELSW_OFFSET 0x000000A4
#define MDM_GFO_SETKDELSW_INDEX 0x00000029
#define MDM_GFO_SETKDELSW_RESET 0x00000014

