kercre123/victor/robot/fixture/cube/sdk_da1458x/5.0.4/sdk/platform/include/reg_modem.h
__INLINE uint32_t mdm_gfo_setkdelsw_get(void) {
  return REG_RPL_RD(MDM_GFO_SETKDELSW_ADDR);
}

__INLINE void mdm_gfo_setkdelsw_set(uint32_t value) {
  REG_RPL_WR(MDM_GFO_SETKDELSW_ADDR, value);
}

// field definitions
#define MDM_GFO_SETKDELSW_MASK ((uint32_t)0x0000007F)
#define MDM_GFO_SETKDELSW_LSB 0
#define MDM_GFO_SETKDELSW_WIDTH ((uint32_t)0x00000007)

#define MDM_GFO_SETKDELSW_RST 0x14

__INLINE uint8_t mdm_gfo_setkdelsw_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_GFO_SETKDELSW_ADDR);
  ASSERT_ERR((localVal & ~((uint32_t)0x0000007F)) == 0);
  return (localVal >> 0);
}

__INLINE void mdm_gfo_setkdelsw_setf(uint8_t gfosetkdelsw) {
  ASSERT_ERR((((uint32_t)gfosetkdelsw << 0) & ~((uint32_t)0x0000007F)) == 0);
  REG_RPL_WR(MDM_GFO_SETKDELSW_ADDR, (uint32_t)gfosetkdelsw << 0);
}

/**
 * @brief GFO_SETKDELPL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  06:00        GFO_SETKDELPL   0x14
 * </pre>
 */
#define MDM_GFO_SETKDELPL_ADDR 0x000000A5
#define MDM_GFO_SETKDELPL_OFFSET 0x000000A5
#define MDM_GFO_SETKDELPL_INDEX 0x00000029
#define MDM_GFO_SETKDELPL_RESET 0x00000014

__INLINE uint32_t mdm_gfo_setkdelpl_get(void) {
  return REG_RPL_RD(MDM_GFO_SETKDELPL_ADDR);
}

__INLINE void mdm_gfo_setkdelpl_set(uint32_t value) {
  REG_RPL_WR(MDM_GFO_SETKDELPL_ADDR, value);
}

// field definitions
#define MDM_GFO_SETKDELPL_MASK ((uint32_t)0x0000007F)
#define MDM_GFO_SETKDELPL_LSB 0
#define MDM_GFO_SETKDELPL_WIDTH ((uint32_t)0x00000007)

#define MDM_GFO_SETKDELPL_RST 0x14

__INLINE uint8_t mdm_gfo_setkdelpl_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_GFO_SETKDELPL_ADDR);
  ASSERT_ERR((localVal & ~((uint32_t)0x0000007F)) == 0);
  return (localVal >> 0);
}

__INLINE void mdm_gfo_setkdelpl_setf(uint8_t gfosetkdelpl) {
  ASSERT_ERR((((uint32_t)gfosetkdelpl << 0) & ~((uint32_t)0x0000007F)) == 0);
  REG_RPL_WR(MDM_GFO_SETKDELPL_ADDR, (uint32_t)gfosetkdelpl << 0);
}

/**
 * @brief GFO_CONVDEL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  06:00          GFO_CONVDEL   0x1E
 * </pre>
 */
#define MDM_GFO_CONVDEL_ADDR 0x000000A6
#define MDM_GFO_CONVDEL_OFFSET 0x000000A6
#define MDM_GFO_CONVDEL_INDEX 0x00000029
#define MDM_GFO_CONVDEL_RESET 0x0000001E

__INLINE uint32_t mdm_gfo_convdel_get(void) {
  return REG_RPL_RD(MDM_GFO_CONVDEL_ADDR);
}

__INLINE void mdm_gfo_convdel_set(uint32_t value) {
  REG_RPL_WR(MDM_GFO_CONVDEL_ADDR, value);
}

// field definitions
#define MDM_GFO_CONVDEL_MASK ((uint32_t)0x0000007F)
#define MDM_GFO_CONVDEL_LSB 0
#define MDM_GFO_CONVDEL_WIDTH ((uint32_t)0x00000007)

#define MDM_GFO_CONVDEL_RST 0x1E

__INLINE uint8_t mdm_gfo_convdel_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_GFO_CONVDEL_ADDR);
  ASSERT_ERR((localVal & ~((uint32_t)0x0000007F)) == 0);
  return (localVal >> 0);
}

__INLINE void mdm_gfo_convdel_setf(uint8_t gfoconvdel) {
  ASSERT_ERR((((uint32_t)gfoconvdel << 0) & ~((uint32_t)0x0000007F)) == 0);
  REG_RPL_WR(MDM_GFO_CONVDEL_ADDR, (uint32_t)gfoconvdel << 0);
}

/**
 * @brief GFO_ESTSW register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  10:00            GFO_ESTSW   0x0
 * </pre>
 */
#define MDM_GFO_ESTSW_ADDR 0x000000A7
#define MDM_GFO_ESTSW_OFFSET 0x000000A7
#define MDM_GFO_ESTSW_INDEX 0x00000029
#define MDM_GFO_ESTSW_RESET 0x00000000

__INLINE uint32_t mdm_gfo_estsw_get(void) {
  return REG_RPL_RD(MDM_GFO_ESTSW_ADDR);
}

__INLINE void mdm_gfo_estsw_set(uint32_t value) {
  REG_RPL_WR(MDM_GFO_ESTSW_ADDR, value);
}

// field definitions
#define MDM_GFO_ESTSW_MASK ((uint32_t)0x000007FF)
#define MDM_GFO_ESTSW_LSB 0
#define MDM_GFO_ESTSW_WIDTH ((uint32_t)0x0000000B)

#define MDM_GFO_ESTSW_RST 0x0

__INLINE uint16_t mdm_gfo_estsw_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_GFO_ESTSW_ADDR);
  ASSERT_ERR((localVal & ~((uint32_t)0x000007FF)) == 0);
  return (localVal >> 0);
}

/**
 * @brief GFO_ESTPL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  10:00            GFO_ESTPL   0x0
 * </pre>
 */
#define MDM_GFO_ESTPL_ADDR 0x000000A8
#define MDM_GFO_ESTPL_OFFSET 0x000000A8
#define MDM_GFO_ESTPL_INDEX 0x0000002A
#define MDM_GFO_ESTPL_RESET 0x00000000

__INLINE uint32_t mdm_gfo_estpl_get(void) {
  return REG_RPL_RD(MDM_GFO_ESTPL_ADDR);
}

__INLINE void mdm_gfo_estpl_set(uint32_t value) {
  REG_RPL_WR(MDM_GFO_ESTPL_ADDR, value);
}

// field definitions
#define MDM_GFO_ESTPL_MASK ((uint32_t)0x000007FF)
#define MDM_GFO_ESTPL_LSB 0
#define MDM_GFO_ESTPL_WIDTH ((uint32_t)0x0000000B)

#define MDM_GFO_ESTPL_RST 0x0

__INLINE uint16_t mdm_gfo_estpl_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_GFO_ESTPL_ADDR);
  ASSERT_ERR((localVal & ~((uint32_t)0x000007FF)) == 0);
  return (localVal >> 0);
}

/**
 * @brief GFO_INIT register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  25:16          GFO_INITDEL   0x34
 *  09:00        GFO_DPLATENCY   0x1E
 * </pre>
 */
#define MDM_GFO_INIT_ADDR 0x000000A9
#define MDM_GFO_INIT_OFFSET 0x000000A9
#define MDM_GFO_INIT_INDEX 0x0000002A
#define MDM_GFO_INIT_RESET 0x0034001E

__INLINE uint32_t mdm_gfo_init_get(void) {
  return REG_RPL_RD(MDM_GFO_INIT_ADDR);
}

__INLINE void mdm_gfo_init_set(uint32_t value) {
  REG_RPL_WR(MDM_GFO_INIT_ADDR, value);
}

// field definitions
#define MDM_GFO_INITDEL_MASK ((uint32_t)0x03FF0000)
#define MDM_GFO_INITDEL_LSB 16
#define MDM_GFO_INITDEL_WIDTH ((uint32_t)0x0000000A)
#define MDM_GFO_DPLATENCY_MASK ((uint32_t)0x000003FF)
#define MDM_GFO_DPLATENCY_LSB 0
#define MDM_GFO_DPLATENCY_WIDTH ((uint32_t)0x0000000A)

#define MDM_GFO_INITDEL_RST 0x34
#define MDM_GFO_DPLATENCY_RST 0x1E

__INLINE void mdm_gfo_init_pack(uint16_t gfoinitdel, uint16_t gfodplatency) {
  ASSERT_ERR((((uint32_t)gfoinitdel << 16) & ~((uint32_t)0x03FF0000)) == 0);
  ASSERT_ERR((((uint32_t)gfodplatency << 0) & ~((uint32_t)0x000003FF)) == 0);
  REG_RPL_WR(MDM_GFO_INIT_ADDR,
             ((uint32_t)gfoinitdel << 16) | ((uint32_t)gfodplatency << 0));
}

__INLINE void mdm_gfo_init_unpack(uint16_t* gfoinitdel,
                                  uint16_t* gfodplatency) {
  uint32_t localVal = REG_RPL_RD(MDM_GFO_INIT_ADDR);

