kercre123/victor/robot/fixture/cube/sdk_da1458x/5.0.4/sdk/platform/include/reg_modem.h
  *gfoinitdel = (localVal & ((uint32_t)0x03FF0000)) >> 16;
  *gfodplatency = (localVal & ((uint32_t)0x000003FF)) >> 0;
}

__INLINE uint16_t mdm_gfo_initdel_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_GFO_INIT_ADDR);
  return ((localVal & ((uint32_t)0x03FF0000)) >> 16);
}

__INLINE void mdm_gfo_initdel_setf(uint16_t gfoinitdel) {
  ASSERT_ERR((((uint32_t)gfoinitdel << 16) & ~((uint32_t)0x03FF0000)) == 0);
  REG_RPL_WR(MDM_GFO_INIT_ADDR,
             (REG_RPL_RD(MDM_GFO_INIT_ADDR) & ~((uint32_t)0x03FF0000)) |
                 ((uint32_t)gfoinitdel << 16));
}

__INLINE uint16_t mdm_gfo_dplatency_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_GFO_INIT_ADDR);
  return ((localVal & ((uint32_t)0x000003FF)) >> 0);
}

__INLINE void mdm_gfo_dplatency_setf(uint16_t gfodplatency) {
  ASSERT_ERR((((uint32_t)gfodplatency << 0) & ~((uint32_t)0x000003FF)) == 0);
  REG_RPL_WR(MDM_GFO_INIT_ADDR,
             (REG_RPL_RD(MDM_GFO_INIT_ADDR) & ~((uint32_t)0x000003FF)) |
                 ((uint32_t)gfodplatency << 0));
}

/**
 * @brief ACSYNCTUNE register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  03:00       DFE_ACSYNCTUNE   0x5
 * </pre>
 */
#define MDM_ACSYNCTUNE_ADDR 0x000000AA
#define MDM_ACSYNCTUNE_OFFSET 0x000000AA
#define MDM_ACSYNCTUNE_INDEX 0x0000002A
#define MDM_ACSYNCTUNE_RESET 0x00000005

__INLINE uint32_t mdm_acsynctune_get(void) {
  return REG_RPL_RD(MDM_ACSYNCTUNE_ADDR);
}

__INLINE void mdm_acsynctune_set(uint32_t value) {
  REG_RPL_WR(MDM_ACSYNCTUNE_ADDR, value);
}

// field definitions
#define MDM_DFE_ACSYNCTUNE_MASK ((uint32_t)0x0000000F)
#define MDM_DFE_ACSYNCTUNE_LSB 0
#define MDM_DFE_ACSYNCTUNE_WIDTH ((uint32_t)0x00000004)

#define MDM_DFE_ACSYNCTUNE_RST 0x5

__INLINE uint8_t mdm_dfe_acsynctune_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_ACSYNCTUNE_ADDR);
  ASSERT_ERR((localVal & ~((uint32_t)0x0000000F)) == 0);
  return (localVal >> 0);
}

__INLINE void mdm_dfe_acsynctune_setf(uint8_t dfeacsynctune) {
  ASSERT_ERR((((uint32_t)dfeacsynctune << 0) & ~((uint32_t)0x0000000F)) == 0);
  REG_RPL_WR(MDM_ACSYNCTUNE_ADDR, (uint32_t)dfeacsynctune << 0);
}

/**
 * @brief PE_POWERTHR register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  05:00          PE_POWERTHR   0x0
 * </pre>
 */
#define MDM_PE_POWERTHR_ADDR 0x000000AB
#define MDM_PE_POWERTHR_OFFSET 0x000000AB
#define MDM_PE_POWERTHR_INDEX 0x0000002A
#define MDM_PE_POWERTHR_RESET 0x00000000

__INLINE uint32_t mdm_pe_powerthr_get(void) {
  return REG_RPL_RD(MDM_PE_POWERTHR_ADDR);
}

__INLINE void mdm_pe_powerthr_set(uint32_t value) {
  REG_RPL_WR(MDM_PE_POWERTHR_ADDR, value);
}

// field definitions
#define MDM_PE_POWERTHR_MASK ((uint32_t)0x0000003F)
#define MDM_PE_POWERTHR_LSB 0
#define MDM_PE_POWERTHR_WIDTH ((uint32_t)0x00000006)

#define MDM_PE_POWERTHR_RST 0x0

__INLINE uint8_t mdm_pe_powerthr_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_PE_POWERTHR_ADDR);
  ASSERT_ERR((localVal & ~((uint32_t)0x0000003F)) == 0);
  return (localVal >> 0);
}

__INLINE void mdm_pe_powerthr_setf(uint8_t pepowerthr) {
  ASSERT_ERR((((uint32_t)pepowerthr << 0) & ~((uint32_t)0x0000003F)) == 0);
  REG_RPL_WR(MDM_PE_POWERTHR_ADDR, (uint32_t)pepowerthr << 0);
}

/**
 * @brief DPLATENCY_CNTL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  17:16             DPL_TUNE   0x2
 *  09:00            GB_LENGTH   0x0
 * </pre>
 */
#define MDM_DPLATENCY_CNTL_ADDR 0x000000AC
#define MDM_DPLATENCY_CNTL_OFFSET 0x000000AC
#define MDM_DPLATENCY_CNTL_INDEX 0x0000002B
#define MDM_DPLATENCY_CNTL_RESET 0x00020000

__INLINE uint32_t mdm_dplatency_cntl_get(void) {
  return REG_RPL_RD(MDM_DPLATENCY_CNTL_ADDR);
}

__INLINE void mdm_dplatency_cntl_set(uint32_t value) {
  REG_RPL_WR(MDM_DPLATENCY_CNTL_ADDR, value);
}

// field definitions
#define MDM_DPL_TUNE_MASK ((uint32_t)0x00030000)
#define MDM_DPL_TUNE_LSB 16
#define MDM_DPL_TUNE_WIDTH ((uint32_t)0x00000002)
#define MDM_GB_LENGTH_MASK ((uint32_t)0x000003FF)
#define MDM_GB_LENGTH_LSB 0
#define MDM_GB_LENGTH_WIDTH ((uint32_t)0x0000000A)

#define MDM_DPL_TUNE_RST 0x2
#define MDM_GB_LENGTH_RST 0x0

__INLINE void mdm_dplatency_cntl_unpack(uint8_t* dpltune, uint16_t* gblength) {
  uint32_t localVal = REG_RPL_RD(MDM_DPLATENCY_CNTL_ADDR);

  *dpltune = (localVal & ((uint32_t)0x00030000)) >> 16;
  *gblength = (localVal & ((uint32_t)0x000003FF)) >> 0;
}

__INLINE uint8_t mdm_dpl_tune_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_DPLATENCY_CNTL_ADDR);
  return ((localVal & ((uint32_t)0x00030000)) >> 16);
}

__INLINE void mdm_dpl_tune_setf(uint8_t dpltune) {
  ASSERT_ERR((((uint32_t)dpltune << 16) & ~((uint32_t)0x00030000)) == 0);
  REG_RPL_WR(MDM_DPLATENCY_CNTL_ADDR, (uint32_t)dpltune << 16);
}

__INLINE uint16_t mdm_gb_length_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_DPLATENCY_CNTL_ADDR);
  return ((localVal & ((uint32_t)0x000003FF)) >> 0);
}

/**
 * @brief RXDPSK_CNTL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  19:08             RRC_GAIN   0x0
 *     07           RRC_ENGAIN   1
 *     02               COC_EN   1
 *     01            DFD_ENFOT   1
 *     00               FOE_EN   1
 * </pre>
 */
#define MDM_RXDPSK_CNTL_ADDR 0x000000B0
#define MDM_RXDPSK_CNTL_OFFSET 0x000000B0
#define MDM_RXDPSK_CNTL_INDEX 0x0000002C
#define MDM_RXDPSK_CNTL_RESET 0x00000087

__INLINE uint32_t mdm_rxdpsk_cntl_get(void) {
  return REG_RPL_RD(MDM_RXDPSK_CNTL_ADDR);
}

__INLINE void mdm_rxdpsk_cntl_set(uint32_t value) {
  REG_RPL_WR(MDM_RXDPSK_CNTL_ADDR, value);
}

// field definitions
#define MDM_RRC_GAIN_MASK ((uint32_t)0x000FFF00)
#define MDM_RRC_GAIN_LSB 8
#define MDM_RRC_GAIN_WIDTH ((uint32_t)0x0000000C)
#define MDM_RRC_ENGAIN_BIT ((uint32_t)0x00000080)
#define MDM_RRC_ENGAIN_POS 7
#define MDM_COC_EN_BIT ((uint32_t)0x00000004)
#define MDM_COC_EN_POS 2
#define MDM_DFD_ENFOT_BIT ((uint32_t)0x00000002)
#define MDM_DFD_ENFOT_POS 1
#define MDM_FOE_EN_BIT ((uint32_t)0x00000001)
#define MDM_FOE_EN_POS 0

#define MDM_RRC_GAIN_RST 0x0
#define MDM_RRC_ENGAIN_RST 0x1
#define MDM_COC_EN_RST 0x1
#define MDM_DFD_ENFOT_RST 0x1
#define MDM_FOE_EN_RST 0x1

__INLINE void mdm_rxdpsk_cntl_pack(uint16_t rrcgain, uint8_t rrcengain,
                                   uint8_t cocen, uint8_t dfdenfot,
                                   uint8_t foeen) {
  ASSERT_ERR((((uint32_t)rrcgain << 8) & ~((uint32_t)0x000FFF00)) == 0);
  ASSERT_ERR((((uint32_t)rrcengain << 7) & ~((uint32_t)0x00000080)) == 0);
  ASSERT_ERR((((uint32_t)cocen << 2) & ~((uint32_t)0x00000004)) == 0);
  ASSERT_ERR((((uint32_t)dfdenfot << 1) & ~((uint32_t)0x00000002)) == 0);
  ASSERT_ERR((((uint32_t)foeen << 0) & ~((uint32_t)0x00000001)) == 0);
  REG_RPL_WR(MDM_RXDPSK_CNTL_ADDR,
             ((uint32_t)rrcgain << 8) | ((uint32_t)rrcengain << 7) |
                 ((uint32_t)cocen << 2) | ((uint32_t)dfdenfot << 1) |
                 ((uint32_t)foeen << 0));
}

__INLINE void mdm_rxdpsk_cntl_unpack(uint16_t* rrcgain, uint8_t* rrcengain,
                                     uint8_t* cocen, uint8_t* dfdenfot,
                                     uint8_t* foeen) {
  uint32_t localVal = REG_RPL_RD(MDM_RXDPSK_CNTL_ADDR);

  *rrcgain = (localVal & ((uint32_t)0x000FFF00)) >> 8;
  *rrcengain = (localVal & ((uint32_t)0x00000080)) >> 7;
  *cocen = (localVal & ((uint32_t)0x00000004)) >> 2;
  *dfdenfot = (localVal & ((uint32_t)0x00000002)) >> 1;
  *foeen = (localVal & ((uint32_t)0x00000001)) >> 0;
}

__INLINE uint16_t mdm_rrc_gain_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_RXDPSK_CNTL_ADDR);
  return ((localVal & ((uint32_t)0x000FFF00)) >> 8);
}

__INLINE void mdm_rrc_gain_setf(uint16_t rrcgain) {
  ASSERT_ERR((((uint32_t)rrcgain << 8) & ~((uint32_t)0x000FFF00)) == 0);
  REG_RPL_WR(MDM_RXDPSK_CNTL_ADDR,
             (REG_RPL_RD(MDM_RXDPSK_CNTL_ADDR) & ~((uint32_t)0x000FFF00)) |
                 ((uint32_t)rrcgain << 8));
}

