kercre123/victor/robot/fixture/cube/sdk_da1458x/5.0.4/sdk/platform/include/reg_modem.h
__INLINE uint8_t mdm_rrc_engain_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_RXDPSK_CNTL_ADDR);
  return ((localVal & ((uint32_t)0x00000080)) >> 7);
}

__INLINE void mdm_rrc_engain_setf(uint8_t rrcengain) {
  ASSERT_ERR((((uint32_t)rrcengain << 7) & ~((uint32_t)0x00000080)) == 0);
  REG_RPL_WR(MDM_RXDPSK_CNTL_ADDR,
             (REG_RPL_RD(MDM_RXDPSK_CNTL_ADDR) & ~((uint32_t)0x00000080)) |
                 ((uint32_t)rrcengain << 7));
}

__INLINE uint8_t mdm_coc_en_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_RXDPSK_CNTL_ADDR);
  return ((localVal & ((uint32_t)0x00000004)) >> 2);
}

__INLINE void mdm_coc_en_setf(uint8_t cocen) {
  ASSERT_ERR((((uint32_t)cocen << 2) & ~((uint32_t)0x00000004)) == 0);
  REG_RPL_WR(MDM_RXDPSK_CNTL_ADDR,
             (REG_RPL_RD(MDM_RXDPSK_CNTL_ADDR) & ~((uint32_t)0x00000004)) |
                 ((uint32_t)cocen << 2));
}

__INLINE uint8_t mdm_dfd_enfot_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_RXDPSK_CNTL_ADDR);
  return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

__INLINE void mdm_dfd_enfot_setf(uint8_t dfdenfot) {
  ASSERT_ERR((((uint32_t)dfdenfot << 1) & ~((uint32_t)0x00000002)) == 0);
  REG_RPL_WR(MDM_RXDPSK_CNTL_ADDR,
             (REG_RPL_RD(MDM_RXDPSK_CNTL_ADDR) & ~((uint32_t)0x00000002)) |
                 ((uint32_t)dfdenfot << 1));
}

__INLINE uint8_t mdm_foe_en_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_RXDPSK_CNTL_ADDR);
  return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

__INLINE void mdm_foe_en_setf(uint8_t foeen) {
  ASSERT_ERR((((uint32_t)foeen << 0) & ~((uint32_t)0x00000001)) == 0);
  REG_RPL_WR(MDM_RXDPSK_CNTL_ADDR,
             (REG_RPL_RD(MDM_RXDPSK_CNTL_ADDR) & ~((uint32_t)0x00000001)) |
                 ((uint32_t)foeen << 0));
}

/**
 * @brief TE_TIMEINIT register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  21:16      BEFORE_TIMEINIT   0x3F
 *  10:00          TE_TIMEINIT   0x302
 * </pre>
 */
#define MDM_TE_TIMEINIT_ADDR 0x000000B1
#define MDM_TE_TIMEINIT_OFFSET 0x000000B1
#define MDM_TE_TIMEINIT_INDEX 0x0000002C
#define MDM_TE_TIMEINIT_RESET 0x003F0302

__INLINE uint32_t mdm_te_timeinit_get(void) {
  return REG_RPL_RD(MDM_TE_TIMEINIT_ADDR);
}

__INLINE void mdm_te_timeinit_set(uint32_t value) {
  REG_RPL_WR(MDM_TE_TIMEINIT_ADDR, value);
}

// field definitions
#define MDM_BEFORE_TIMEINIT_MASK ((uint32_t)0x003F0000)
#define MDM_BEFORE_TIMEINIT_LSB 16
#define MDM_BEFORE_TIMEINIT_WIDTH ((uint32_t)0x00000006)
#define MDM_TE_TIMEINIT_MASK ((uint32_t)0x000007FF)
#define MDM_TE_TIMEINIT_LSB 0
#define MDM_TE_TIMEINIT_WIDTH ((uint32_t)0x0000000B)

#define MDM_BEFORE_TIMEINIT_RST 0x3F
#define MDM_TE_TIMEINIT_RST 0x302

__INLINE void mdm_te_timeinit_pack(uint8_t beforetimeinit,
                                   uint16_t tetimeinit) {
  ASSERT_ERR((((uint32_t)beforetimeinit << 16) & ~((uint32_t)0x003F0000)) == 0);
  ASSERT_ERR((((uint32_t)tetimeinit << 0) & ~((uint32_t)0x000007FF)) == 0);
  REG_RPL_WR(MDM_TE_TIMEINIT_ADDR,
             ((uint32_t)beforetimeinit << 16) | ((uint32_t)tetimeinit << 0));
}

__INLINE void mdm_te_timeinit_unpack(uint8_t* beforetimeinit,
                                     uint16_t* tetimeinit) {
  uint32_t localVal = REG_RPL_RD(MDM_TE_TIMEINIT_ADDR);

  *beforetimeinit = (localVal & ((uint32_t)0x003F0000)) >> 16;
  *tetimeinit = (localVal & ((uint32_t)0x000007FF)) >> 0;
}

__INLINE uint8_t mdm_before_timeinit_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_TE_TIMEINIT_ADDR);
  return ((localVal & ((uint32_t)0x003F0000)) >> 16);
}

__INLINE void mdm_before_timeinit_setf(uint8_t beforetimeinit) {
  ASSERT_ERR((((uint32_t)beforetimeinit << 16) & ~((uint32_t)0x003F0000)) == 0);
  REG_RPL_WR(MDM_TE_TIMEINIT_ADDR,
             (REG_RPL_RD(MDM_TE_TIMEINIT_ADDR) & ~((uint32_t)0x003F0000)) |
                 ((uint32_t)beforetimeinit << 16));
}

__INLINE uint16_t mdm_te_timeinit_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_TE_TIMEINIT_ADDR);
  return ((localVal & ((uint32_t)0x000007FF)) >> 0);
}

__INLINE void mdm_te_timeinit_setf(uint16_t tetimeinit) {
  ASSERT_ERR((((uint32_t)tetimeinit << 0) & ~((uint32_t)0x000007FF)) == 0);
  REG_RPL_WR(MDM_TE_TIMEINIT_ADDR,
             (REG_RPL_RD(MDM_TE_TIMEINIT_ADDR) & ~((uint32_t)0x000007FF)) |
                 ((uint32_t)tetimeinit << 0));
}

/**
 * @brief DFD_KFACTOR register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  08:00          DFD_KFACTOR   0x33
 * </pre>
 */
#define MDM_DFD_KFACTOR_ADDR 0x000000B2
#define MDM_DFD_KFACTOR_OFFSET 0x000000B2
#define MDM_DFD_KFACTOR_INDEX 0x0000002C
#define MDM_DFD_KFACTOR_RESET 0x00000033

__INLINE uint32_t mdm_dfd_kfactor_get(void) {
  return REG_RPL_RD(MDM_DFD_KFACTOR_ADDR);
}

__INLINE void mdm_dfd_kfactor_set(uint32_t value) {
  REG_RPL_WR(MDM_DFD_KFACTOR_ADDR, value);
}

// field definitions
#define MDM_DFD_KFACTOR_MASK ((uint32_t)0x000001FF)
#define MDM_DFD_KFACTOR_LSB 0
#define MDM_DFD_KFACTOR_WIDTH ((uint32_t)0x00000009)

#define MDM_DFD_KFACTOR_RST 0x33

__INLINE uint16_t mdm_dfd_kfactor_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_DFD_KFACTOR_ADDR);
  ASSERT_ERR((localVal & ~((uint32_t)0x000001FF)) == 0);
  return (localVal >> 0);
}

__INLINE void mdm_dfd_kfactor_setf(uint16_t dfdkfactor) {
  ASSERT_ERR((((uint32_t)dfdkfactor << 0) & ~((uint32_t)0x000001FF)) == 0);
  REG_RPL_WR(MDM_DFD_KFACTOR_ADDR, (uint32_t)dfdkfactor << 0);
}

/**
 * @brief COC_KFACTOR register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  09:00          COC_KFACTOR   0x5
 * </pre>
 */
#define MDM_COC_KFACTOR_ADDR 0x000000B3
#define MDM_COC_KFACTOR_OFFSET 0x000000B3
#define MDM_COC_KFACTOR_INDEX 0x0000002C
#define MDM_COC_KFACTOR_RESET 0x00000005

__INLINE uint32_t mdm_coc_kfactor_get(void) {
  return REG_RPL_RD(MDM_COC_KFACTOR_ADDR);
}

__INLINE void mdm_coc_kfactor_set(uint32_t value) {
  REG_RPL_WR(MDM_COC_KFACTOR_ADDR, value);
}

