kercre123/victor/robot/fixture/cube/sdk_da1458x/5.0.4/sdk/platform/include/reg_modem.h
// field definitions
#define MDM_GSG_VCO_DEN_MASK ((uint32_t)0x0000001F)
#define MDM_GSG_VCO_DEN_LSB 0
#define MDM_GSG_VCO_DEN_WIDTH ((uint32_t)0x00000005)

#define MDM_GSG_VCO_DEN_RST 0x6

__INLINE uint8_t mdm_gsg_vco_den_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_GSG_VCO_DEN_ADDR);
  ASSERT_ERR((localVal & ~((uint32_t)0x0000001F)) == 0);
  return (localVal >> 0);
}

__INLINE void mdm_gsg_vco_den_setf(uint8_t gsgvcoden) {
  ASSERT_ERR((((uint32_t)gsgvcoden << 0) & ~((uint32_t)0x0000001F)) == 0);
  REG_RPL_WR(MDM_GSG_VCO_DEN_ADDR, (uint32_t)gsgvcoden << 0);
}

/**
 * @brief GSG_VCO_NOM register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  07:00          GSG_VCO_NOM   0x27
 * </pre>
 */
#define MDM_GSG_VCO_NOM_ADDR 0x000000C5
#define MDM_GSG_VCO_NOM_OFFSET 0x000000C5
#define MDM_GSG_VCO_NOM_INDEX 0x00000031
#define MDM_GSG_VCO_NOM_RESET 0x00000027

__INLINE uint32_t mdm_gsg_vco_nom_get(void) {
  return REG_RPL_RD(MDM_GSG_VCO_NOM_ADDR);
}

__INLINE void mdm_gsg_vco_nom_set(uint32_t value) {
  REG_RPL_WR(MDM_GSG_VCO_NOM_ADDR, value);
}

// field definitions
#define MDM_GSG_VCO_NOM_MASK ((uint32_t)0x000000FF)
#define MDM_GSG_VCO_NOM_LSB 0
#define MDM_GSG_VCO_NOM_WIDTH ((uint32_t)0x00000008)

#define MDM_GSG_VCO_NOM_RST 0x27

__INLINE uint8_t mdm_gsg_vco_nom_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_GSG_VCO_NOM_ADDR);
  ASSERT_ERR((localVal & ~((uint32_t)0x000000FF)) == 0);
  return (localVal >> 0);
}

__INLINE void mdm_gsg_vco_nom_setf(uint8_t gsgvconom) {
  ASSERT_ERR((((uint32_t)gsgvconom << 0) & ~((uint32_t)0x000000FF)) == 0);
  REG_RPL_WR(MDM_GSG_VCO_NOM_ADDR, (uint32_t)gsgvconom << 0);
}

/**
 * @brief FM2PSW_LAT register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  03:00           FM2PSW_LAT   0x0
 * </pre>
 */
#define MDM_FM2PSW_LAT_ADDR 0x000000C6
#define MDM_FM2PSW_LAT_OFFSET 0x000000C6
#define MDM_FM2PSW_LAT_INDEX 0x00000031
#define MDM_FM2PSW_LAT_RESET 0x00000000

__INLINE uint32_t mdm_fm2psw_lat_get(void) {
  return REG_RPL_RD(MDM_FM2PSW_LAT_ADDR);
}

__INLINE void mdm_fm2psw_lat_set(uint32_t value) {
  REG_RPL_WR(MDM_FM2PSW_LAT_ADDR, value);
}

// field definitions
#define MDM_FM2PSW_LAT_MASK ((uint32_t)0x0000000F)
#define MDM_FM2PSW_LAT_LSB 0
#define MDM_FM2PSW_LAT_WIDTH ((uint32_t)0x00000004)

#define MDM_FM2PSW_LAT_RST 0x0

__INLINE uint8_t mdm_fm2psw_lat_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_FM2PSW_LAT_ADDR);
  ASSERT_ERR((localVal & ~((uint32_t)0x0000000F)) == 0);
  return (localVal >> 0);
}

__INLINE void mdm_fm2psw_lat_setf(uint8_t fm2pswlat) {
  ASSERT_ERR((((uint32_t)fm2pswlat << 0) & ~((uint32_t)0x0000000F)) == 0);
  REG_RPL_WR(MDM_FM2PSW_LAT_ADDR, (uint32_t)fm2pswlat << 0);
}

/**
 * @brief GSG_DPHI_DEN register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  19:16      LE_GSG_DPHI_DEN   0x5
 *  03:00      BT_GSG_DPHI_DEN   0x0
 * </pre>
 */
#define MDM_GSG_DPHI_DEN_ADDR 0x000000C7
#define MDM_GSG_DPHI_DEN_OFFSET 0x000000C7
#define MDM_GSG_DPHI_DEN_INDEX 0x00000031
#define MDM_GSG_DPHI_DEN_RESET 0x00050000

__INLINE uint32_t mdm_gsg_dphi_den_get(void) {
  return REG_RPL_RD(MDM_GSG_DPHI_DEN_ADDR);
}

__INLINE void mdm_gsg_dphi_den_set(uint32_t value) {
  REG_RPL_WR(MDM_GSG_DPHI_DEN_ADDR, value);
}

// field definitions
#define MDM_LE_GSG_DPHI_DEN_MASK ((uint32_t)0x000F0000)
#define MDM_LE_GSG_DPHI_DEN_LSB 16
#define MDM_LE_GSG_DPHI_DEN_WIDTH ((uint32_t)0x00000004)
#define MDM_BT_GSG_DPHI_DEN_MASK ((uint32_t)0x0000000F)
#define MDM_BT_GSG_DPHI_DEN_LSB 0
#define MDM_BT_GSG_DPHI_DEN_WIDTH ((uint32_t)0x00000004)

#define MDM_LE_GSG_DPHI_DEN_RST 0x5
#define MDM_BT_GSG_DPHI_DEN_RST 0x0

__INLINE void mdm_gsg_dphi_den_pack(uint8_t legsgdphiden,
                                    uint8_t btgsgdphiden) {
  ASSERT_ERR((((uint32_t)legsgdphiden << 16) & ~((uint32_t)0x000F0000)) == 0);
  ASSERT_ERR((((uint32_t)btgsgdphiden << 0) & ~((uint32_t)0x0000000F)) == 0);
  REG_RPL_WR(MDM_GSG_DPHI_DEN_ADDR,
             ((uint32_t)legsgdphiden << 16) | ((uint32_t)btgsgdphiden << 0));
}

__INLINE void mdm_gsg_dphi_den_unpack(uint8_t* legsgdphiden,
                                      uint8_t* btgsgdphiden) {
  uint32_t localVal = REG_RPL_RD(MDM_GSG_DPHI_DEN_ADDR);

  *legsgdphiden = (localVal & ((uint32_t)0x000F0000)) >> 16;
  *btgsgdphiden = (localVal & ((uint32_t)0x0000000F)) >> 0;
}

__INLINE uint8_t mdm_le_gsg_dphi_den_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_GSG_DPHI_DEN_ADDR);
  return ((localVal & ((uint32_t)0x000F0000)) >> 16);
}

__INLINE void mdm_le_gsg_dphi_den_setf(uint8_t legsgdphiden) {
  ASSERT_ERR((((uint32_t)legsgdphiden << 16) & ~((uint32_t)0x000F0000)) == 0);
  REG_RPL_WR(MDM_GSG_DPHI_DEN_ADDR,
             (REG_RPL_RD(MDM_GSG_DPHI_DEN_ADDR) & ~((uint32_t)0x000F0000)) |
                 ((uint32_t)legsgdphiden << 16));
}

__INLINE uint8_t mdm_bt_gsg_dphi_den_getf(void) {
  uint32_t localVal = REG_RPL_RD(MDM_GSG_DPHI_DEN_ADDR);
  return ((localVal & ((uint32_t)0x0000000F)) >> 0);
}

__INLINE void mdm_bt_gsg_dphi_den_setf(uint8_t btgsgdphiden) {
  ASSERT_ERR((((uint32_t)btgsgdphiden << 0) & ~((uint32_t)0x0000000F)) == 0);
  REG_RPL_WR(MDM_GSG_DPHI_DEN_ADDR,
             (REG_RPL_RD(MDM_GSG_DPHI_DEN_ADDR) & ~((uint32_t)0x0000000F)) |
                 ((uint32_t)btgsgdphiden << 0));
}

/**
 * @brief GSG_DPHI_NOM register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  22:16      LE_GSG_DPHI_NOM   0x35
 *  06:00      BT_GSG_DPHI_NOM   0x1
 * </pre>
 */
#define MDM_GSG_DPHI_NOM_ADDR 0x000000C8
#define MDM_GSG_DPHI_NOM_OFFSET 0x000000C8
#define MDM_GSG_DPHI_NOM_INDEX 0x00000032
#define MDM_GSG_DPHI_NOM_RESET 0x00350001

__INLINE uint32_t mdm_gsg_dphi_nom_get(void) {
  return REG_RPL_RD(MDM_GSG_DPHI_NOM_ADDR);
}

__INLINE void mdm_gsg_dphi_nom_set(uint32_t value) {
  REG_RPL_WR(MDM_GSG_DPHI_NOM_ADDR, value);
}

